<?xml version="1.0" encoding="UTF-8"?>
<xsl:stylesheet version='2.0' xmlns:xsl='http://www.w3.org/1999/XSL/Transform' xmlns:xs='http://www.w3.org/2001/XMLSchema'>
  <xsl:output omit-xml-declaration='no' indent='yes' version='1.0' encoding='utf-8'/>

  <!-- разделитель строк входного файла-->
  <xsl:param name='rowDelimiter'>\r?\n</xsl:param>

  <!-- преобразуемая информация, во время выполнения подменяется значениями из входных файлов от определенного ДООО  -->
  <!-- ASTRA_IMPORT_CS<ddmmyyyyHHmi>.csv-->
  <xsl:param name='inputContent' as='xs:string'>
    Л-Юганс 1 П1,301,0,1.000,2017072500,0
    Л-Юганс 2 П2,341,749,2.000,2017072500,0
    Сорум   1 П1,303,350,3.000,2017072500,0
    Сорум   2 П2,343,370,4.000,2017072500,0
    Казымск 1 П1,305,679,5.000,2017072500,0
    Казымск 2 П2,345,0,6.000,2017072500,0
    Пунга   1 П1,307,0,7.000,2017072500,0
    Пунга   2 П2,347,790,8.000,2017072500,0
    ПХГ Пунга,319,0,9.000,2017072500,0
    Сосьвин 1 Х1,203,0,10.000,2017072500,0
    Приполя 1 Х1,205,0,11.000,2017072500,0
    Комсомо 1 Ср,309,0,12.000,2017072500,0
    Комсомо 3 Нт,389,405,13.000,2017072500,0
    Комсомо 2 У2,349,402,14.000,2017072500,0
    Пелым   1 Ср,311,0,15.000,2017072500,0
    Пелым   3 Нт,391,0,16.000,2017072500,0
    Пелым   2 У2,351,0,17.000,2017072500,0
    Ивдельс 1 Ср,313,0,18.000,2017072500,0
    Ивдельс 3 Нт,393,0,19.000,2017072500,0
    Ивдельс 2 У2,353,0,20.000,2017072500,0
    К.Турин 3 Нт,395,0,22.000,2017072500,0
    К.Турин 2 У2,355,0,23.000,2017072500,0
    Н.Тура Арлан,317,1143,24.000,2017072500,0
    Н.Тура  3 Нт,397,0,25.000,2017072500,0
    Н.Тура  2 У2,357,0,26.000,2017072500,0
    Н.Уренг 2 Н2,179,1447,28.000,2017072500,0
    Н.Уренг 3 Пт,4101,1252,29.000,2017072500,0
    Н.Уренг 4 Нп,4141,0,30.000,2017072500,0
    ЦДКС-2/1  Мд,5003,389,31.000,2017072500,0
    Пангоды 2 Нд,141,1660,32.000,2017072500,0
    Пангоды 3 Н2,181,1105,33.000,2017072500,0
    Пангоды 4 Пт,4103,1044,34.000,2017072500,0
    Пангоды 5 Нп,4143,1095,35.000,2017072500,0
    Надым   3 П3,103,0,36.000,2017072500,0
    Надым   4 П4,243,824,37.000,2017072500,0
    Надым   5 Н2,183,831,38.000,2017072500,0
    Надым   6 Пт,4105,1204,39.000,2017072500,0
    Надым   7 Нп,4145,812,40.000,2017072500,0
    Л-Юганс 3 П3,105,439,41.000,2017072500,0
    Л-Юганс 4 П4,145,865,42.000,2017072500,0
    Л-Юганс 5 П5,185,937,43.000,2017072500,0
    Л-Юганс 6 Пт,4107,543,44.000,2017072500,0
    Л-Юганс 7 Нп,4147,547,45.000,2017072500,0
    Сорум   3 П3,107,1224,46.000,2017072500,0
    Сорум   4 П4,147,465,47.000,2017072500,0
    Сорум   5 П5,187,1361,48.000,2017072500,0
    Сорум   6 Пт,4109,932,49.000,2017072500,0
    Сорум   7 Нп,4149,0,50.000,2017072500,0
    Казымск 3 П3,109,0,51.000,2017072500,0
    Казымск 4 П4,149,726,52.000,2017072500,0
    Казымск 5 П5,189,788,53.000,2017072500,0
    Казымск 6 Пт,4111,785,54.000,2017072500,0
    Казымск 7 Нп,4151,770,55.000,2017072500,0
    Перегре 3 П3,201,0,56.000,2017072500,0
    Перегре 4 П4,111,380,57.000,2017072500,0
    Перегре 5 П5,151,773,58.000,2017072500,0
    Перегре 6 Пт,4113,0,59.000,2017072500,0
    Перегре 7 Нп,4153,1433,60.000,2017072500,0
    Сосьвин 3 Гр,153,480,61.000,2017072500,0
    Сосьвин 2 Х2,113,941,62.000,2017072500,0
    Приполя 3 Гр,155,708,63.000,2017072500,0
    Приполя 2 Х2,115,714,64.000,2017072500,0
    У-Юган  1 Пт,4115,0,65.000,2017072500,0
    У-Юган  2 Нп,4155,1300,66.000,2017072500,0
    Комсомо 4 Пт,4117,1274,67.000,2017072500,0
    Комсомо 5 Нп,4157,0,68.000,2017072500,0
    Пелым   4 Пт,4119,794,69.000,2017072500,0
    Пелым   5 Нп,4159,792,70.000,2017072500,0
    Ивдельс 4 Пт,4121,0,71.000,2017072500,0
    Ивдельс 5 Нп,4161,0,72.000,2017072500,0
    К.Турин 4 Пт,4123,913,73.000,2017072500,0
    К.Турин 5 Нп,4163,1042,74.000,2017072500,0
    Лялинск 1 Пт,4125,869,75.000,2017072500,0
    Лялинск 2 Нп,4165,1105,76.000,2017072500,0
    Пуровск 1 Уж,4701,791,77.000,2017072500,0
    Пуровск 2 Ц1,4741,1327,78.000,2017072500,0
    Пуровск 3 Ц2,4781,887,79.000,2017072500,0
    Хасырей 1 Уж,4703,691,80.000,2017072500,0
    Хасырей 2 Ц1,4743,468,81.000,2017072500,0
    Хасырей 3 Ц2,4783,978,82.000,2017072500,0
    Ямбургс 1 Е1,4301,820,83.000,2017072500,0
    Ямбургс 2 Е2,4341,427,84.000,2017072500,0
    Ямбургс 3 Пр,4381,0,85.000,2017072500,0
    Ямбургс 4 Т1,2101,0,86.000,2017072500,0
    Ямбургс 5 Т2,2141,0,87.000,2017072500,0
    Ямбургс 6 Пв,2181,485,88.000,2017072500,0
    Ямбургс 7 Ур,2221,543,89.000,2017072500,0
    Ныда    1 Е1,4303,882,90.000,2017072500,0
    Ныда    2 Е2,4343,882,91.000,2017072500,0
    Ныда    3 Пр,4383,873,92.000,2017072500,0
    Ныда    4 Т1,2103,447,93.000,2017072500,0
    Ныда    5 Т2,2143,1360,94.000,2017072500,0
    Ныда    6 Пв,2183,737,95.000,2017072500,0
    Ныда    7 Ур,2223,740,96.000,2017072500,0
    П.Хетти 1 Уж,4705,0,97.000,2017072500,0
    П.Хетти 2 Ц1,4745,1371,98.000,2017072500,0
    П.Хетти 3 Ц2,4785,1373,99.000,2017072500,0
    П.Хетти 4 Е1,4825,1346,100.000,2017072500,0
    П.Хетти 5 Е2,4405,0,101.000,2017072500,0
    П.Хетти 6 Пр,4445,1336,102.000,2017072500,0
    П.Хетти 7 Т1,2105,1373,103.000,2017072500,0
    П.Хетти 8 Т2,2145,958,104.000,2017072500,0
    П.Хетти 9 Пв,2185,922,105.000,2017072500,0
    П.Хетт 10 Ур,2225,492,106.000,2017072500,0
    Ягельна 1 Уж,4707,0,107.000,2017072500,0
    Ягельна 2 Ц1,4747,0,108.000,2017072500,0
    Ягельна 3 Ц2,4787,0,109.000,2017072500,0
    Ягельна 4 Е1,4827,449,110.000,2017072500,0
    Ягельна 5 Е2,4407,870,111.000,2017072500,0
    Ягельна 6 Пр,4447,1305,112.000,2017072500,0
    Ягельна 7 Т1,2107,1302,113.000,2017072500,0
    Ягельна 8 Т2,2147,1293,114.000,2017072500,0
    Ягельна 9 Пв,2187,570,115.000,2017072500,0
    Ягельн 10 Ур,2227,899,116.000,2017072500,0
    Приозер 1 Уж,4709,678,117.000,2017072500,0
    Приозер 2 Ц1,4749,956,118.000,2017072500,0
    Приозер 3 Ц2,4789,0,119.000,2017072500,0
    Приозер 4 Е1,4829,914,120.000,2017072500,0
    Приозер 5 Е2,4409,479,121.000,2017072500,0
    Приозер 6 Пр,4449,1412,122.000,2017072500,0
    Приозер 7 Т1,2109,1423,123.000,2017072500,0
    Приозер 8 Т2,2149,947,124.000,2017072500,0
    Приозер 9 Пв,2189,940,125.000,2017072500,0
    Приозе 10 Ур,2229,482,126.000,2017072500,0
    Сосновс 1 Уж,4711,0,127.000,2017072500,0
    Сосновс 2 Ц1,4751,0,128.000,2017072500,0
    Сосновс 3 Ц2,4791,0,129.000,2017072500,0
    Сосновс 4 Е1,4831,1280,130.000,2017072500,0
    Сосновс 5 Е2,4411,891,131.000,2017072500,0
    Сосновс 6 Пр,4451,1309,132.000,2017072500,0
    Сосновс 7 Т1,2111,885,133.000,2017072500,0
    Сосновс 8 Т2,2151,883,134.000,2017072500,0
    Сосновс 9 Пв,2191,894,135.000,2017072500,0
    Соснов 10 Ур,2231,1307,136.000,2017072500,0
    В.Казым 1 Уж,4713,686,137.000,2017072500,0
    В.Казым 2 Ц1,4753,1336,138.000,2017072500,0
    В.Казым 3 Ц2,4793,0,139.000,2017072500,0
    В.Казым 4 Е1,4833,1376,140.000,2017072500,0
    В.Казым 5 Е2,4413,1380,141.000,2017072500,0
    В.Казым 6 Пр,4453,458,142.000,2017072500,0
    В.Казым 7 Т1,2113,0,143.000,2017072500,0
    В.Казым 8 Т2,2153,476,144.000,2017072500,0
    В.Казым 9 Пв,2193,0,145.000,2017072500,0
    В.Казы 10 Ур,2233,0,146.000,2017072500,0
    Бобровс 1 Уж,4715,0,147.000,2017072500,0
    Бобровс 2 Ц1,4755,1288,148.000,2017072500,0
    Бобровс 3 Ц2,4795,1297,149.000,2017072500,0
    Бобровс 4 Е1,4835,0,150.000,2017072500,0
    Бобровс 5 Е2,4415,1369,151.000,2017072500,0
    Бобровс 6 Пр,4455,1369,152.000,2017072500,0
    Бобровс 7 Т1,2115,0,153.000,2017072500,0
    Бобровс 8 Т2,2155,1361,154.000,2017072500,0
    Бобровс 9 Пв,2195,1299,155.000,2017072500,0
    Бобров 10 Ур,2235,1291,156.000,2017072500,0
    Октябрь 1 Уж,4717,0,157.000,2017072500,0
    Октябрь 2 Ц1,4757,0,158.000,2017072500,0
    Октябрь 3 Ц2,4797,1483,159.000,2017072500,0
    Октябрь 4 Е1,4837,1013,160.000,2017072500,0
    Октябрь 5 Е2,4417,1010,161.000,2017072500,0
    Октябрь 6 Пр,4457,1477,162.000,2017072500,0
    Октябрь 7 Т1,2117,0,163.000,2017072500,0
    Октябрь 8 Т2,2157,1005,164.000,2017072500,0
    Октябрь 9 Пв,2197,1013,165.000,2017072500,0
    Октябр 10 Ур,2237,1015,166.000,2017072500,0
    Таежная 1 Уж,4719,653,167.000,2017072500,0
    Таежная 2 Ц1,4759,1290,168.000,2017072500,0
    Таежная 3 Ц2,4799,1267,169.000,2017072500,0
    Таежная 4 Е1,4839,1234,170.000,2017072500,0
    Таежная 5 Е2,4419,1244,171.000,2017072500,0
    Таежная 6 Пр,4459,625,172.000,2017072500,0
    Таежная 7 Т1,2119,1408,173.000,2017072500,0
    Таежная 8 Т2,2159,261,174.000,2017072500,0
    Таежная 9 Пв,2199,1134,175.000,2017072500,0
    Таежна 10 Ур,2239,592,176.000,2017072500,0
    Н.Комсо 1 Уж,4721,1238,177.000,2017072500,0
    Н.Комсо 2 Ц1,4761,744,178.000,2017072500,0
    Н.Комсо 3 Ц2,4801,507,179.000,2017072500,0
    Н.Комсо 4 Е1,4841,0,180.000,2017072500,0
    Пелым   6 Уж,4723,1302,181.000,2017072500,0
    Пелым   7 Ц1,4763,517,182.000,2017072500,0
    Пелым   8 Ц2,4803,1012,183.000,2017072500,0
    Пелым   9 Е1,4843,1014,184.000,2017072500,0
    Ивдельс 6 Уж,4725,1306,185.000,2017072500,0
    Ивдельс 7 Ц1,4765,1008,186.000,2017072500,0
    Ивдельс 8 Ц2,4805,0,187.000,2017072500,0
    Ивдельс 9 Е1,4845,0,188.000,2017072500,0
    К.Турин 6 Уж,4727,685,189.000,2017072500,0
    К.Турин 7 Ц1,4767,0,190.000,2017072500,0
    К.Турин 8 Ц2,4807,1521,191.000,2017072500,0
    К.Турин 9 Е1,4847,1262,192.000,2017072500,0
    Лялинск 3 Уж,4729,0,193.000,2017072500,0
    Лялинск 4 Ц1,4769,0,194.000,2017072500,0
    Лялинск 5 Ц2,4809,0,195.000,2017072500,0
    Лялинск 6 Е1,4849,0,196.000,2017072500,0
    Н.Комсо 5 Е2,4421,655,197.000,2017072500,0
    Н.Комсо 6 Пр,4461,0,198.000,2017072500,0
    Н.Комсо 7 Т1,2121,0,199.000,2017072500,0
    Н.Комсо 8 Т2,2161,1101,200.000,2017072500,0
    Н.Комсо 9 Пв,2201,884,201.000,2017072500,0
    Н.Комс 10 Ур,2241,890,202.000,2017072500,0
    Н.Пелым 1 Е2,4423,1564,203.000,2017072500,0
    Н.Пелым 2 Пр,4463,1561,204.000,2017072500,0
    Н.Пелым 3 Т1,2123,990,205.000,2017072500,0
    Н.Пелым 4 Т2,2163,899,206.000,2017072500,0
    Н.Пелым 5 Пв,2203,920,207.000,2017072500,0
    Н.Пелым 6 Ур,2243,0,208.000,2017072500,0
    Н.Ивдел 1 Е2,4425,0,209.000,2017072500,0
    Н.Ивдел 2 Пр,4465,0,210.000,2017072500,0
    Н.Ивдел 3 Т1,2125,0,211.000,2017072500,0
    Н.Ивдел 4 Т2,2165,1407,212.000,2017072500,0
    Н.Ивдел 5 Пв,2205,504,213.000,2017072500,0
    Н.Ивдел 6 Ур,2245,511,214.000,2017072500,0
    Карпинс 1 Е2,4427,1075,215.000,2017072500,0
    Карпинс 2 Пр,4467,1081,216.000,2017072500,0
    Карпинс 3 Т1,2127,1078,217.000,2017072500,0
    Карпинс 4 Т2,2167,897,218.000,2017072500,0
    Карпинс 5 Пв,2207,961,219.000,2017072500,0
    Карпинс 6 Ур,2247,977,220.000,2017072500,0
    ЦДКС-1/1  Мд,5001,1345,221.000,2017072500,0
    ЦДКС-1/2  Мд,5041,847,222.000,2017072500,0
    ЦДКС-2/2  Мд,5043,940,223.000,2017072500,0
    Пангоды 6 ТА,4183,1301,224.000,2017072500,0
    Сосьвин 4 То,193,895,225.000,2017072500,0
    Приполя 4 То,195,0,226.000,2017072500,0
    Перегре 8 То,4193,0,227.000,2017072500,0

  </xsl:param>

  <!-- разбивка на массив строк -->
  <xsl:variable name='rows' as='xs:string*' select="tokenize($inputContent, $rowDelimiter)"/>

  <!-- метка времени сеанса-->
  <xsl:param name='regexTimestamp' >,(\d{10}),</xsl:param>

  <xsl:param name="timestamp">
    <xsl:analyze-string select="translate($rows[2] , ' ','')" flags="x" regex='{$regexTimestamp}'>
      <xsl:matching-substring>
        <xsl:value-of select="concat(   substring( regex-group(1), 1,4),'-' ,substring( regex-group(1), 5,2), '-' , substring( regex-group(1), 7,2), 'T' ,substring( regex-group(1), 9,2)  , ':00:00'   )"/>
      </xsl:matching-substring>
    </xsl:analyze-string>
  </xsl:param>

  <!-- тип периода сеанса -->
  <xsl:param name='periodType'>Twohours</xsl:param>

  <!-- разделитель строк входного файла-->
  <xsl:param name='columnDelimiter'>,</xsl:param>

  <xsl:template match='/'>
    <ExchangeMessage>
      <HeaderSection>
        <TimeStamp>
          <xsl:value-of select="$timestamp"/>
          <xsl:message>
            <xsl:value-of select='$timestamp' />
          </xsl:message>
        </TimeStamp>
        <PeriodType>
          <xsl:value-of select="$periodType"/>
        </PeriodType>
      </HeaderSection>
      <DataSection>
        <ExtItems>
          <xsl:for-each select='$rows'>
            <!-- разбивка строки на колонки -->
            <xsl:variable name='currentRow'  select='.'/>
            <xsl:variable name='splitRow' as='xs:string*' select="tokenize($currentRow, $columnDelimiter)"/>
            <!-- данные по КЦ, перекачка газа -->
            <xsl:if test="count($splitRow) = 6">
              <!--<xsl:message>KC<xsl:value-of select='$splitRow' /></xsl:message>-->
              <ExtItem>
                <ExtKey>
                  <xsl:value-of select="normalize-space( $splitRow[2] )"/>
                </ExtKey>
                <Value>
                  <xsl:value-of select="normalize-space( $splitRow[3] )"/>
                </Value>
                
              </ExtItem>
              
            </xsl:if>
           
          </xsl:for-each>
        </ExtItems>
      </DataSection>
    </ExchangeMessage>
  </xsl:template>
</xsl:stylesheet>